In [1]:
import pandas as pd

# Question 1
Answer : Five functions of the pandas library with execution.

1. read_csv() - used to read a csv file

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

2. describe() - used to describe some common mathematical terms of every dataset.

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

3. head() - print the first five rows of dataset.

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

4. tail() - print last five rows of dataset.

In [6]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

5. sort_values() - used to sort the rows of dataframe based on one or more columns

In [7]:
df.sort_values(by='Fare').head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S

In [8]:
df.sort_values(by='Fare').tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

# Question 2
Answer :

In [9]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [10]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
def reindex_dataframe(df) : 
    rows = df.shape[0]

    newindex = pd.RangeIndex(start=1, stop=rows*2, step=2)

    df = df.set_index(newindex)

    return df

In [12]:
reindex_dataframe(df1)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

# Question 3
Answer :

In [13]:
df2 = pd.DataFrame({'Values' : [10,20,30,40,50]})

In [14]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [15]:
def iterate_sum(df) :
    s = 0
    for i in df['Values'][:3]: 
        s+=i
    return s

In [16]:
iterate_sum(df2)

60

# Question 4
Answer :

In [17]:
df4 = pd.DataFrame({'Text' : ['Apple is good','Mango is very good','Grapes is not good','Banana is awesome','Dates']})

In [18]:
df4

                 Text
0       Apple is good
1  Mango is very good
2  Grapes is not good
3   Banana is awesome
4               Dates

In [19]:
def add_col_word_count(df):
    words = df['Text'].str.split()

    df['Word_Count'] = words.apply(len)

    return df

In [20]:
add_col_word_count(df4)

                 Text  Word_Count
0       Apple is good           3
1  Mango is very good           4
2  Grapes is not good           4
3   Banana is awesome           3
4               Dates           1

# Question 5
Answer : 
            
            DataFrame.size() - return the product of number of rows and column or we can say return the total number elements.
            DataFrame.shape() - return a tuple '(a,b)' where a = number of rows and b =  number of columns.

In [21]:
df5 = pd.DataFrame({'Name': ['John', 'Emma', 'Peter', 'Anna'],
        'Age': [28, 34, 29, 25],
        'City': ['New York', 'London', 'Paris', 'Sydney']})

In [22]:
df.size

10692

In [23]:
df.shape

(891, 12)

# Question 6
Answer : read_excel() is used to read an excel file in pandas.

# Question 7
Answer :

In [24]:
df7 = pd.DataFrame({'Email': ['john@example.com', 'annop@example.com', 'shreyansh@example.com','gautam@example.com']})

In [25]:
df7

                   Email
0       john@example.com
1      annop@example.com
2  shreyansh@example.com
3     gautam@example.com

In [26]:
def add_username(df) : 
    df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])
    return df

In [27]:
add_username(df7)

                   Email   Username
0       john@example.com       john
1      annop@example.com      annop
2  shreyansh@example.com  shreyansh
3     gautam@example.com     gautam

# Question 8
Answer :

In [28]:
df8 = pd.DataFrame({'A' : [3,8,6,2,9], 'B' : [5,2,9,3,1], 'C' : [1,7,4,5,2]})

In [29]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [30]:
def select_rows(df) : 
    selected_rows_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows_df

In [31]:
select_rows(df8)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Question 9
Answer :

In [32]:
df9 = pd.DataFrame({'Values' : [10,20,30,40,50]})

In [33]:
def calculate_stats(df) : 
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return ('''Mean = {}, Median = {}, Standard Deviation = {}'''.format(mean,median,std))

In [34]:
calculate_stats(df9)

'Mean = 30.0, Median = 30.0, Standard Deviation = 15.811388300841896'

# Question 10
Answer :

In [35]:
df10 = pd.DataFrame({'Sales': [10, 12, 15, 20, 18, 25, 22, 30, 28, 35],
                   'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05',
                            '2022-01-06', '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10']})

In [36]:
df10['Date'] = pd.to_datetime(df10['Date'])

In [37]:
def calculate_moving_average(df):
    rolling_window = df['Sales'].rolling(window=7, min_periods=1)
    moving_average = rolling_window.mean()
    df['MovingAverage'] = moving_average
    return df

In [38]:
calculate_moving_average(df10)

   Sales       Date  MovingAverage
0     10 2022-01-01      10.000000
1     12 2022-01-02      11.000000
2     15 2022-01-03      12.333333
3     20 2022-01-04      14.250000
4     18 2022-01-05      15.000000
5     25 2022-01-06      16.666667
6     22 2022-01-07      17.428571
7     30 2022-01-08      20.285714
8     28 2022-01-09      22.571429
9     35 2022-01-10      25.428571

# Question 11
Answer :

In [39]:
df11 = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

In [40]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [41]:
add_weekday_column(df11)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Question 12
Answer :

In [42]:
df12 = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-02-01', '2023-02-02']})

In [43]:
df12['Date'] = pd.to_datetime(df12['Date'])

In [44]:
def select_rows_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    mask = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')
    selected_rows = df.loc[mask]
    return selected_rows

In [45]:
select_rows_dates(df12)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03

# Question 13
Answer : First and Firstmost we have the import the Pandas library itself like 'import pandas as pd'.